Revit 2024 API
MaterialNode.Smoothness Property
 The level of smoothness of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int Smoothness { get; }
Visual Basic
Public ReadOnly Property Smoothness As Integer
	Get
Visual C++
public:
property int Smoothness {
	int get ();
}
See Also
MaterialNode Class
Autodesk.Revit.DB Namespace